{
  "home": {
    "formName": "Nome Completo",
    "message": "Mensagem",
    "greeting": "Olá, eu sou",
    "name": "Fernando Vasconcelos Melo Costa",
    "developer": " Sou desenvolvedor full stack",
    "github": "Visitar GitHub",
    "imageText": "Vai ter uma imagem aqui",
    "about": "Sobre Mim",
    "aboutDescription": "Sou um desenvolvedor Full Stack. Atualmente, minhas linguagens favoritas são JavaScript utilizando o Node.js com TypeScript para criação de APIs, Next.js com TypeScript para desenvolvimento web e ReactNative com TypeScript para desenvolvimento de apps mobile.",
    "linkedin": "Visitar Linkedin",
    "services": "Serviços",
    "servicesDescription1": "Se você precisa de alguém para desenvolver um aplicativo, site pessoal, comercial ou até mesmo uma simples landing page você está no lugar certo!",
    "servicesDescription2": "Realizo as entregas dos projetos através do Github em um repositório privado ou público, com o intuito de manter o código sempre versionado, facilitando o processo de controle de histórico.",
    "development": "Development",
    "developmentDescription": "Desenvolvimento de projetos end-to-end, criando APIs no padrão REST e criando websites dinâmicos ou estáticos.",
    "mobileFriendly": "Mobile-friendly",
    "mobileFriendlyDescription": "Design responsivo, tornando seu site acessível, independentemente do dispositivo. Criando telas com base no conceito Mobile First.",
    "analytics": "Analytics",
    "analyticsDescription": "Obtenha informações sobre quem está navegando em seu site, para que você possa tomar decisões de negócios mais inteligentes.",
    "cleanCode": "Clean code",
    "cleanCodeDescription": "Desenvolvimento seguindo os principais design patterns, com objetivo de tornar o código mais intuitivo, elegante e com fácil manutenção.",
    "skills": "Skills",
    "skillsContainer": "Seja bem-vindo a sessão skill. Caso queira conhecer um pouco mais sobre alguma skill, basta clicar em cima da skill desejada!!",
    "contact": "Contato",
    "contactDescription": "Entre em contato para dúvidas, sugestões, orçamentos ou suporte.",
    "socialMedia": "Vai ter os ícones das redes sociais",
    "sendButton": "Enviar Mensagem",
    "Node": "Node.js é uma poderosa plataforma de tempo de execução JavaScript construída sobre o motor JavaScript V8 do Chrome. Ela permite que você execute código JavaScript no lado do servidor, possibilitando a construção de aplicações web escaláveis e de alto desempenho. O Node.js possui um ecossistema rico de bibliotecas e frameworks, o que o torna uma escolha popular para o desenvolvimento de aplicações no lado do servidor.",
    "TypeScript": "TypeScript é uma linguagem de programação desenvolvida e mantida pela Microsoft. Apresentando recursos adicionais, como vinculação de tipos estritos para JavaScript. TypeScript supera uma das maiores falhas do JavaScript, que é encontrar bugs no código durante a fase de desenvolvimento, verificando qualquer problema no tempo de compilação, impedindo a entrega do produto com defeitos para o cliente final.",
    "JavaScript": "JavaScript é uma linguagem leve e habitualmente usado nas páginas webs, cujas implementações permitem que o script do lado do cliente interaja com o usuário e crie páginas dinâmicas. É uma linguagem de programação interpretada com recursos orientados a objetos.",
    "Docker": "Docker consiste em uma plataforma Open Source, cujo objetivo é gerenciar aplicativos em contêineres como se fossem VMs. Os contêineres são isolados uns dos outros e agrupam seus próprios softwares, bibliotecas e arquivos de configuração.",
    "GitHub": "GitHub é uma plataforma de hospedagem de código-fonte e arquivos com controle de versão usando o Git, permitindo que os programadores ou qualquer usuário da plataforma contribuam em projetos privados e/ou Open Source em qualquer lugar do mundo",
    "Next": "Next.js é um framework React popular para construir aplicações web. Ele oferece renderização do lado do servidor, divisão automática de código e recursos simples de roteamento, entre outras funcionalidades. O Next.js simplifica o processo de desenvolvimento e melhora o desempenho ao otimizar o carregamento e a renderização das páginas web",
    "ReactNative": "React Native é um framework para construção de aplicativos móveis nativos usando JavaScript e React. Ele permite que você escreva código uma vez e o implante em várias plataformas, como iOS e Android. O React Native fornece um conjunto de componentes pré-construídos que se assemelham de perto aos componentes de UI nativos, permitindo que você crie aplicativos móveis de alta qualidade e com bom desempenho usando a sintaxe familiar do React.",
    "React": "React é uma biblioteca JavaScript para construir interfaces de usuário. Ela permite que você crie componentes de UI reutilizáveis que são atualizados de forma eficiente e proporcionam uma experiência do usuário contínua. O React segue uma abordagem declarativa, onde você descreve como a sua UI deve parecer com base no seu estado atual, e o React se encarrega de atualizar a UI de forma eficiente quando o estado muda."
  }
}
